Repository: DavidChateauvert/dave_sm_app
Catalog: lib/l10n/app_*.arb
Languages: fr

# language
source: English
fr: Français

# welcomeMessage
source: Welcome {name} !
fr: Bienvenue {name} !

# joined_at
source: Joined Dave on {date}
fr: A rejoint Dave le {date}

source: Edit Profile
fr: Modifier votre profil

source: Unfriend
fr: Ne plus être ami

source: Request Sent
fr: Demande d'ami envoyé

source: Accept Request
fr: Accepter la demande d'ami

# ask_to_be_friend
source: Ask to be a friend
fr: Faire une demande d'ami

source: Posts
fr: Publications

source: Friends
fr: Amis

# likes
source: {likeCount} likes
fr: {likeCount} J'aime

source: Settings
fr: Réglages

source: Change theme
fr: Changer le thème

source: Change language
fr: Changer la langue

source: Reset Notifications
fr: Effacer les notifications

source: About Us
fr: À propos

source: Contact Us
fr: Contactez-nous

source: Log Out
fr: Déconnexion

source: Timeline
fr: Fil d'actualités

source: Search
fr: Recherche

source: Post
fr: Publier

source: Profile
fr: Profil

# make_a_post
source: Post
fr: Publier

# send_post
source: Post
fr: Envoyer

source: Write a post ...
fr: Écrite une publication ...

source: Comments
fr: Commentaires

source: Write a comment...
fr: Écrire un commentaire...

# send_comment
source: Post
fr: Publier

source: Find Users
fr: Trouver des gens

# search_user
source: Search
fr: Rechercher

source: First Name
fr: Prénom

source: Last Name
fr: Nom de famille

source: Change Profile Picture
fr: Changer la photo de profil

# update_first_name
source: Update your fist Name
fr: Modifer votre prénom

source: First Name Too Short
fr: Prénom est trop court

source: First Name Too Long
fr: Prénom est trop Long

# update_last_name
source: Update your last Name
fr: Modifer votre nom de famille

source: Last Name Too Short
fr: Nom de famille est trop court

source: Last Name Too Long
fr: Nom de famille est trop Long

# update_bio
source: Update your bio
fr: Modifier votre bio

# bio_too_long
source: Last Name Too Short
fr: Bio est trop long

source: Profile Updated!
fr: Profil modifié avec succès!

source: Photo with camera
fr: Photo avec camera

source: Video with camera
fr: Vidéo avec camera

# photo_or_video_with_camera
source: Image or Video from Gallery
fr: Photo ou vidéo depuis la gallerie

source: Image from gallery
fr: Image depuis gallerie

# activity_item_text_like
source: liked your post
fr: a aimé votre publication

# activity_item_text_follow
source: is following you
fr: vous suit

# activity_item_text_message
source: sent you a message
fr: vous a envoyé un message

# activity_item_text_comment
source: replied: {commentData}
fr: a répondu: {commentData}

# activity_item_text_mention
source: has tagged you in a post
fr: vous a identifié dans une publication

# activity_item_text_commentLike
source: liked your comment
fr: a aimé votre commentaire

# activity_item_text_error
source: Error: Unkown type {type}
fr: Erreur: Type Inconnu {type}

# likesAppBar
source: Likes
fr: J'aime

# send_image
source: Send an Image
fr: Envoyer une image

# message_with_photo
source: With a photo: {message}
fr: Avec une photo: {message}

# message_only_photo
source: Sent a photo
fr: A envoyé une photo

# message_controller_placeholder
source: Write a message...
fr: Écrire un message...

# add_media_to_post
source: Add a media to the post
fr: Rajouter un média

source: Report
fr: Reporter

source: Delete
fr: Supprimer

# who_sent
source: Me :
fr: Moi :

# report_post
source: Report this post ?
fr: Reporter cette publication ?

# report_user
source: Report this user ?
fr: Reporter cette personne ?

# report_conversation
source: Report this conversation with {username}
fr: Reporter cette conversation avec {username}

source: Cancel
fr: Annuler

# delete_conversation
source: Delete this conversation ?
fr: Supprimer cette conversation ?

# delete_conversation_username
source: Delete this conversation with {username}
fr: Supprimer cette conversation avec {username}

# remove_post
source: Remove this post ?
fr: Supprimer cette publication ?

# thanks_input
source: Thank you for your input !
fr: Merci !

# rewiew_text_post
source: Our team is going to review your report and then decide what to do with this post
fr: Notre équipe s'occupera d'examiner votre demande et nous déciderons par le suite ce que nous allons faire avec cette publication

# rewiew_text_user
source: Our team is going to review your report and then decide what to do with this user
fr: Notre équipe s'occupera d'examiner votre demande et nous déciderons par le suite ce que nous allons faire avec cette utilisateur

# go_back_timeline
source: Go back to the timeline
fr: Retourner au fil d'actualités

# report_text_error
source: Your report cannot be empty
fr: Votre rapport ne peut pas être vide

# report_text_hint_post
source: Why should this post be reported ?
fr: Expliquer

# report_text_hint_user
source: Why should this user be reported ?
fr: Expliquer

# report_post_app_bar
source: Report Post
fr: Reporter

# report_user_app_bar
source: Report User
fr: Reporter

# description_report_post
source: Please tell us why your are reporting this post
fr: Veuillez nous expliquer pourquoi vous souhaitez reporter cette publication

# description_report_user
source: Please tell us why your are reporting this user
fr: Veuillez nous expliquer pourquoi vous souhaitez reporter cette utilisateur

source: Submit Report
fr: Soumettre

# about_us_app_bar
source: Ã€ propos de nous
fr: À propos de nous

# about_us_text
source: Dave is a social media app that tries to replicate the instant nature of real life. On other social media app, every post made is set in stone on the internet. On Dave, people can only see your post once and screenshotting it is impossible. Just like in real life, when somebody says something, the thing being said is gone forverer and Dave is replicating this experience online. Dave is only at a beginning stage right now so if there's any bug, please let us know in the 'Contact Us' section on the app. Enjoy Dave !
fr: Dave est une application de médias sociaux qui tente de reproduire la nature instantanée de la vie réelle. Sur d'autres applications de médias sociaux, chaque publication reste gravée dans la pierre sur internet. Sur Dave, les gens ne peuvent voir votre publication qu'une seule fois et la prendre en capture d'écran est impossible. Tout comme dans la vie réelle, quand quelqu'un dit quelque chose, ce qui est dit disparaît pour toujours et Dave reproduit cette expérience en ligne. Dave en est actuellement à ses débuts, donc si vous trouvez un ou des défauts, veuillez-nous le faire savoir dans la section 'Contactez-nous' de l'application. Profitez de Dave !

# about_us_people
source: People behing this app
fr: Les gens derrière l'application

# go_back_settings
source: Go back to the settings
fr: Retourner aux réglages

# please_continue
source: Please continue to enjoy Dave
fr: Veuillez continuer à profiter de Dave

# contact_us_text
source: Please tell us anything you think we should know. This is going to be send to us and we'll come back to you shortly
fr: Veuillez nous dire tout ce que vous pensez que nous devrions savoir. Cela nous sera envoyé et nous vous répondrons sous peu

source: Write us ...
fr: Écrivez-nous ...

# set_up_profile
source: Set Up your Profile
fr: Configurer votre profil

# add_image_profile
source: Add a Profile Picture
fr: Ajouter une photo de profil

# enter_info
source: Enter your informations
fr: Entrer vos informations

# finish_configuration
source: Submit
fr: Finir la configuration

# at_least_one_caracter
source: Must be at least 1 caracter
fr: Doit être au moins 1 caractère

source: Post Already Seen
fr: Publication déjà vu

# welcome_dave
source: Welcome to Dave !
fr: Bienvenue sur Dave !

# select_language
source: Please select a language
fr: Veuillez choisir une langue

# set_up_account
source: Set up your account
fr: Configurer votre profil

# video_too_long
source: Sorry, the maximum duration for videos is 10 seconds
fr: Désolé, la durée maximal pour les vidéos est de 10 secondes

# go_back_upload
source: Go back to post
fr: Retourner à la publication

# post_success
source: Post Successfully Created
fr: Publication créée avec succès

# all_friends
source: All
fr: Tous

# pick_date_of_birth
source: Pick a date of birth
fr: Choisir une date de naissance

# change_date_of_birth
source: Change your date of birth
fr: Changer votre date de naissance

source: Date of birth
fr: Date de naissance

# women_gender
source: Women
fr: Femme

# men_gender
source: Men
fr: Homme

source: Other
fr: Autre

# specified_gender
source: Specify :
fr: Spécifier :

# specified_gender_controller
source: Specify a gender
fr: Spécifier un genre

source: Gender
fr: Genre

# profile_age_gender
source: {age} years old {gender}
fr: {gender} de {age} ans

# profile_age_only
source: {age} years old
fr: {age} ans

source: Email
fr: Courriel

source: Password
fr: Mot de passe

source: Confirm Password
fr: Confirmer mot de passe

source: Forgot Password ?
fr: Mot de passe oublié ?

source: Sign In
fr: Se connecter

source: Sign Up
fr: S'inscrire

# continue_with
source: Or continue with
fr: Ou continuer avec

# not_member
source: Not a Dave Member ?
fr: Pas un membre de Dave ?

# create_acount_button
source: Create an account here
fr: Cliquer ici pour créer un compte

# already_member
source: Already a member ?
fr: Déjà un membre ?

# sign_in_button
source: Sign in here
fr: Cliquer ici pour vous connecter

# error_user_not_found
source: This user does not exist
fr: Cette utilisateur n'existe pas

# error_wrong_password
source: Wront password
fr: Mauvais mot de passe

# error_password_match
source: The password don't match
fr: Les mots de passe ne sont pas identiques

# error_user_disabled
source: This user has been disabled
fr: Cet utilisateur a été désactivé

# error_invalid_email
source: Email is invalid
fr: Le courriel est invalide

# error_email_already_in_use
source: Email already in use
fr: Courriel déjà utilisé

# error_operation_not_allowed
source: Operation not allowed
fr: Operation non permise

# error_weak_password
source: Password not strong enough
fr: Mot de passe trop faible

source: Groups
fr: Groupes

source: Add group
fr: Ajouter groupe

# create_group
source: Create a goup
fr: Créer un groupe

# no_create_group
source: Skip to post
fr: Aller à la publication directement

# create_group_question
source: Do you want to create a group with the selected user ?
fr: Voulez-vous créer un groupe avec les utilisateurs sélectionnés ?

source: Your Groups
fr: Vos groupes

source: Selected User
fr: Utilisateurs choisis

# enter_group_name
source: Enter the name of the group
fr: Entrer le nom du groupe

source: Confirm
fr: Confirmer

# hint_text_group_name
source: Group name
fr: Nom du groupe

# upload_to
source: To :
fr: À :

# default_group
source: Selected Users
fr: Utilisateurs choisis

source: Post Parameters
fr: Paramètres de la publication

# sure_delete_post
source: Are you sure you want to delete this post ?
fr: Êtes-vous de vouloir supprimer cette publication ?

# who_can_see_post
source: Who can see this post
fr: Qui peut voir cette publication

source: Group
fr: Groupe
